#
# ~/.bashrc
#

# If not running interactively, don't do anything
[[ $- != *i* ]] && return

alias ls='ls --color=auto'
alias grep='grep --colour=auto'
alias newnote='nvim -c "enew | set filetype=markdown | ObsidianNew Lecture notes: $(date +%Y-%m-%d-%H%M%S)" +startinsert'

if [ $XDG_SESSION_TYPE != tty ]
then
  source ~/trueline.sh
fi

export QT_QPA_PLATFORMTHEME=gtk3
export PATH=~/.local/bin:$PATH

echo -e "\033[38;5;105m  ██\033[38;5;104m█████╗   █████╗   ██╗   ██╗  ██████╗    ████\033[38;5;103m██╗    █████\033[38;5;97m╗ \033[39m"
sleep .05
echo -e "\033[38;5;105m  ╚═\033[38;5;104m═███╔╝  ██╔══██╗  ██║  ███║  ╚════██╗  ██╔═█\033[38;5;103m███╗  ██╔══█\033[38;5;97m█╗\033[39m"
sleep .05
echo -e "\033[38;5;105m    \033[38;5;104m███╔╝   ███████║  ██║  ╚██║   █████╔╝  ██║██\033[38;5;103m╔██║  ╚█████\033[38;5;97m╔╝\033[39m"
sleep .05
echo -e "\033[38;5;105m   █\033[38;5;104m██╔╝    ██╔══██║  ██║   ██║  ██╔═══╝   ████╔\033[38;5;103m╝██║  ██╔══█\033[38;5;97m█╗\033[39m"
sleep .05
echo -e "\033[38;5;105m  ██\033[38;5;104m█████╗  ██║  ██║  ██║   ██║  ███████╗  ╚████\033[38;5;103m██╔╝  ╚█████\033[38;5;97m╔╝\033[39m"
sleep .05
echo -e "\033[38;5;105m  ╚═\033[38;5;104m═════╝  ╚═╝  ╚═╝  ╚═╝   ╚═╝  ╚══════╝   ╚═══\033[38;5;103m══╝    ╚════\033[38;5;97m╝ \033[39m"

fastfetch
source -- ~/.local/share/blesh/ble.sh
eval "$(zoxide init bash)"
source -- ~/.local/share/blesh/ble.sh
